jahnavinanduri10/microcontrollers_stm32/32_SPI_Interrupt_BareMetal/Src/main.c
#include "stm32f407xx.h"
#include <string.h>
/*
 * AF5 -- SPI2
 * PB14 -- MISO
 * PB15 -- MOSI
 * PB13 -- SCLK
 * PB12 --- NSS
 */
SPI_Handle_t SPI2handle;
void delay(void)
{
	for(uint32_t i = 0;i < 500000;i++);
}

void SPI2_GPIOInits(void)
{
	GPIO_Handle_t SPIPins,NSSpin;

	SPIPins.pGPIOx = GPIOB;
	SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPIPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5;
	SPIPins.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_PP;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	// SCLK
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPIPins);

	// MOSI
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPIPins);

	// MISO
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	GPIO_Init(&SPIPins);

	// NSS
	NSSpin.pGPIOx = GPIOB;
	NSSpin.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	NSSpin.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_PP;
	NSSpin.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	NSSpin.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	NSSpin.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	//GPIO_Init(&NSSpin);
	//GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_12, SET);

}

void SPI2_Init(void)
{
	SPI2handle.pSPIx = SPI2;
	SPI2handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
	SPI2handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI2handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV16;
	SPI2handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
	SPI2handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
	SPI2handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
	SPI2handle.SPIConfig.SPI_SSM = SPI_SSM_EN; //software slave management

	SPI_Init(&SPI2handle);
}

void GPIO_LEDInit()
{
	GPIO_Handle_t GPIOLED;

	GPIOLED.pGPIOx = GPIOD;
	GPIOLED.GPIO_PinConfig.GPIO_PinNumber       = GPIO_PIN_NO_12;
	GPIOLED.GPIO_PinConfig.GPIO_PinMode         = GPIO_MODE_OUT;
	GPIOLED.GPIO_PinConfig.GPIO_PinSpeed        = GPIO_SPEED_FAST;
	GPIOLED.GPIO_PinConfig.GPIO_PinPuPdControl  = GPIO_NO_PUPD;

	GPIO_Init(&GPIOLED);
}
char user_data[] = "Hello world";
char read_buffer[32]; // Buffer to store received data

int main()
{
	GPIO_LEDInit();
    SPI2_GPIOInits();
    SPI2_Init();

    SPI_IRQInterruptConfig(IRQ_NO_SPI2, ENABLE);
    SPI_IRQPriorityConfig(IRQ_NO_SPI2, 0);

    // software slave management
    SPI_SSIConfig(SPI2, ENABLE);
    SPI_SSOEConfig(SPI2, DISABLE);



    SPI_PeripheralControl(SPI2, ENABLE);

    // enable SPI
    SPI_PeripheralControl(SPI2, ENABLE);

    delay();

    //GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_12, RESET);
    //start receiver first so that it will wait for clock

    SPI_SendDataReceiveIT(&SPI2handle, (uint8_t*)user_data, (uint8_t*)read_buffer, strlen(user_data));
    while(1)
    {
    }
}

void SPI2_IRQHandler(void)
{
	SPI_IRQHandling(&SPI2handle);
}

void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle,uint8_t AppvEv)
{
	//wait till the receiving is complete
	if(AppvEv == SPI_EVENT_RX_CMPLT)
	{
		GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_12, SET);
		GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_NO_12, SET);
	}
}
